[
  {
    "date": "2025-01-15",
    "title": "Strona internetowa którą właśnie czytasz!",
    "tags": ["Javascript", "CSS", "HTML"],
    "description": "Pierwsza prawdziwie hostowana strona internetowa z customowym adresem!",
    "codeUrl": "https://github.com/Twoj_Nick/Projekt1",
    "liveUrl": "https://mikipilarsk.site",
    "image": ""
  },
  {
    "date": "2024-12-10",
    "title": "ESP32 Marauder",
    "tags": ["SBC", "ESP32", "COM", "Hacktheworld!"],
    "description": "Multifunkcyjne urządzenie do pentestowania sieci bezprzewodowych.",
    "codeUrl": "https://github.com/justcallmekoko/ESP32Marauder",
    "liveUrl": "",
    "image": "",
    "content": "ESP32 Marauder to niezwykłe urządzenie łączące moc mikrokontrolera ESP32 z zaawansowanymi możliwościami analizy i testowania sieci bezprzewodowych. Jest to praktycznie przenośny pentester sieciowy, idealny zarówno dla enthusiastów IoT, jak i badaczy bezpieczeństwa. Urządzenie potrafi skanować sieci Wi-Fi, analizować pakiety, testować beacon frames, a nawet pracuje jako sniffer — wszystko to w kompaktowym formacie, który zmieści się w kieszeni.\n\nMoim pierwszym wyzwaniem był montaż sprzętu. Choć wydawało się proste — podłącz przewody do pinów GPIO — okazało się trudniejsze niż myślałem. Problem: użyte przewody były zbyt grube dla standardowych pinów ESP32. Zwłaszcza przy lutowaniu, gdzie każdy miał średnicę przewodu trochę inną, trudno było uzyskać czysty, bezpieczny kontakt. Spędziłem dużo czasu próbując dopasować przewody i upewniać się, że lutowanie jest solidne. Ostatecznie wymościłem je na cieńsze, co znacznie ułatwiło pracę.\n\nDrugą przeszkodą było wgranie firmware'u. Początkowe próby kończyły się błędami — urządzenie nie było rozpoznawane przez port COM, a Arduino IDE wyrzucało komunikaty o braku połączenia. Po kilku godzinach debugowania okazało się, że problem tkwił w wyborze odpowiedniego sterownika USB-UART i ustawieniach szybkości transmisji. Po znalezieniu odpowiedniej dokumentacji i instalacji właściwych sterowników, wgranie kodu przeszło gładko.\n\nCały projekt nauczył mnie, że elektronika to nie tylko kod — detale fizyczne, jakość przewodów i połączeń są kluczowe. Dziś urządzenie pracuje bez zarzutu, a jego możliwości są imponujące. To świetna podstawa do dalszych eksperymentów z bezpieczeństwem sieci."
  }
]
